{
  "title": "Automating Phylogenetics with Python",
  "cells": [
    {
      "type": "markdown",
      "data": "**Talk By**: Christopher Hann-Soden\n**Date**: June 22, 2016\n\nHe starts with a bunch of fungus genomes and uses a program MUMer and Filter for syntenous & orthologous regions using Python. Anther student uses HMMer.  \n\n## Orthology finding \n\nIs very stringent.  It does not allow multiple sequences and it has to have a represenative in each genome to be pulled.  He made this script himself and it runs off the MMmer alignment. And it looking for similarity of each genome to the the reference genome. These sequences have not been aligned to each other. \n\nThen it created a number of multiple \"delta\" files.  Not sure what those are and a bunch of different fasta files.  Each file corresponds to the original cordinates.  He trimmed the end of each alignments. **Just what I wanted to do.\"  In something calle `aligned-trimemed.fasta`\n\nI am not really sure exactly how they were found through similarity yet?\n\n## Alignment \n\nMAFT is better than muscle. \n\n-[ ] Check out what his MAFT arguments are.  \n\nThen he ends up with one big alignment. \n\n## For model selection \n\nHe decided to run the partitian on one alignment instead It partitions from concatenated dataset with PartitionFinder2.it runs the partition file on the\n\n\nHe is using shared computer with many different nodes and one each node is memory.  Then there is a slurm scheduler that organizes the job scheduler. \n\nThere are multiple different ways to buy into the server. Maintained by the CGRF.  You can sign up for a free amount depending on the lab. \n\n## Python Script\n\nPython argparse module is awesome it allows you to make clear of argument statments in Python. \n\nPickle is a python module that takes python objects without printing them out.  This could come in handy.\n\nOne thing that Chris does is that before he makes a dataset into a new structure he puts a comment on how that data structure should look like.\n\n\n## Presenting ETE toolkit\n\n\n"
    }
  ]
}